MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX350F128L.atdf
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset as not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Standby Enable bit" name="RCON__VREGS">
         <value caption="Regulator is enabled and is on during Sleep mode" name="" value="0x1" />
         <value caption="Regulator is set to Stand-by Tracking mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="Configuration mismatch Reset has occurred" name="" value="0x1" />
         <value caption="Configuration mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="High Voltage Detect Reset Flag bit" name="RCON__HVDR">
         <value caption="High Voltage Detect (HVD) Reset has occurred" name="" value="0x1" />
         <value caption="HVD Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01618" name="RPOR" version="">
      <register-group name="RPOR">
         <register caption="Peripheral Pin Select Output Register" name="RPA14R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA14R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPA15R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA15R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB0R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB0R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB1R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB2R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB3R" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB3R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB5R" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB5R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB6R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB6R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB7R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB7R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB8R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB8R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB9R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB9R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB10R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB10R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB14R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB14R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPB15R" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB15R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPC1R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPC2R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPC3R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC3R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPC4R" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC4R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPC13R" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC13R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPC14R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC14R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPD0R" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD0R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPD1R" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPD2R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPD3R" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD3R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="RPD4R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD4R" />
         </register>
